app/Models/MultipleModel.php

SELECT *
FROM `merged`
WHERE `product_name` IS NULL
---
function getdata($name)
{
    $db = \Config\Database::connect();
    $builder = $this->table('merged');
    // $this->db->query("select * from products ")->get()->result()
    $builder->select('*');
    $builder->where('product_name', $name);
        $query = $builder->get();